<script setup></script>
<template>
  <section class="about">
    <p class="about__text">
      Привет! Меня зовут Денис, и я фронтенд-разработчик, увлеченный созданием
      современных и удобных веб-интерфейсов. В своей работе я активно использую
      Vue.js и Nuxt, стремясь к тому, чтобы каждый проект был не только
      функциональным, но и эстетически приятным. Постоянно совершенствую свои
      навыки, экспериментируя с новыми технологиями и подходами, чтобы создавать
      качественные и производительные решения.
    </p>
    <br />
    <br />
    <p class="about__text">
      В свободное время я люблю заниматься спортом, смотреть кино и добавлять в
      свою жизнь немного творчества с помощью фотографии — это помогает мне
      находить вдохновение и заряжаться энергией для новых идей.
    </p>
  </section>
</template>

<style lang="scss">
.about {
  margin-top: 200px;
  &__text {
    font-weight: 300;
    line-height: 150%;
  }
}

@media (max-width: 768px) {
  .about {
    margin-top: 140px;
  }
}

@media (max-width: 440px) {
  .about {
    margin-top: 90px;
  }
}
</style>
